Tekla.Structures.ModelInternal.dotBoltGroup_t
Serialization structure for BoltGroup.

Tekla.Structures.ModelInternal.dotBoltGroup_t.ModelObject
Base class.

Tekla.Structures.ModelInternal.dotBoltGroup_t.BoltSize
Bolt Size.

Tekla.Structures.ModelInternal.dotBoltGroup_t.aBoltStandard
Bolt Standard.

Tekla.Structures.ModelInternal.dotBoltGroup_t.BoltType
Bolt Type.

Tekla.Structures.ModelInternal.dotBoltGroup_t.ThreadInMaterial
Thread In Material.

Tekla.Structures.ModelInternal.dotBoltGroup_t.Length
Length, Used for Nelson Standards.

Tekla.Structures.ModelInternal.dotBoltGroup_t.CutLength
Cut Length.

Tekla.Structures.ModelInternal.dotBoltGroup_t.ExtraLength
Extra Length.

Tekla.Structures.ModelInternal.dotBoltGroup_t.Shape
_Shape.

Tekla.Structures.ModelInternal.dotBoltGroup_t.Tolerance
Tolerance.

Tekla.Structures.ModelInternal.dotBoltGroup_t.PlainHoleType
PlainHoleType.

Tekla.Structures.ModelInternal.dotBoltGroup_t.BlindHoleDepth
Blind hole depth.

Tekla.Structures.ModelInternal.dotBoltGroup_t.Position
Position.

Tekla.Structures.ModelInternal.dotBoltGroup_t.aBoltHolesAttributes
The bolt holes attributes

Tekla.Structures.ModelInternal.dotBoltGroup_t.StartPointOffset
Defines the bolt group start point offset.

Tekla.Structures.ModelInternal.dotBoltGroup_t.EndPointOffset
Defines the bolt group end point offset.

Tekla.Structures.ModelInternal.dotBoltGroup_t.Washer1
Washers, 1-3

Tekla.Structures.ModelInternal.dotBoltGroup_t.Washer2
Washers, 1-3

Tekla.Structures.ModelInternal.dotBoltGroup_t.Washer3
Washers, 1-3

Tekla.Structures.ModelInternal.dotBoltGroup_t.Nut1
Nuts, 1-2

Tekla.Structures.ModelInternal.dotBoltGroup_t.Nut2
Nuts, 1-2

Tekla.Structures.ModelInternal.dotBoltGroup_t.Bolt
Bolt

Tekla.Structures.ModelInternal.dotBoltGroup_t.Hole1
Holes, 1-5

Tekla.Structures.ModelInternal.dotBoltGroup_t.Hole2
Holes, 1-5

Tekla.Structures.ModelInternal.dotBoltGroup_t.Hole3
Holes, 1-5

Tekla.Structures.ModelInternal.dotBoltGroup_t.Hole4
Holes, 1-5

Tekla.Structures.ModelInternal.dotBoltGroup_t.Hole5
Holes, 1-5

Tekla.Structures.ModelInternal.dotBoltGroup_t.PartToBoltToId
Part to bolt to

Tekla.Structures.ModelInternal.dotBoltGroup_t.PartToBeBoltedId
Part to be bolted

Tekla.Structures.ModelInternal.dotBoltGroup_t.nOtherPartsToBolt
How many other parts to be bolted

Tekla.Structures.ModelInternal.dotBoltGroup_t.aOtherPartsToBolt
Ids of the other parts to be bolted

Tekla.Structures.ModelInternal.dotBoltGroup_t.FirstPosition
First position point

Tekla.Structures.ModelInternal.dotBoltGroup_t.SecondPosition
Second position point

Tekla.Structures.ModelInternal.dotBoltGroup_t.ConnectAssemblies
Defines connect as secondary part (false) or as sub-assembly (true).